# **********************************************************************************************************************
# Срезы (списки, кортежи, строки)
cities = ['Москва', 'Санкт-Петербург', 'Казань', 'Владивосток', 'Самара', 'Екатеринбург', 'Архангельск']

print(cities[:])  # ['Москва', 'Санкт-Петербург', 'Казань', 'Владивосток', 'Самара', 'Екатеринбург', 'Архангельск']
print(cities[1:3])  # ['Санкт-Петербург', 'Казань']
print(cities[:3])  # ['Москва', 'Санкт-Петербург', 'Казань']
print(cities[3:])  # ['Владивосток', 'Самара', 'Екатеринбург', 'Архангельск']
print(cities[::2])  # ['Москва', 'Казань', 'Самара', 'Архангельск']
print(cities[::-1])  # ['Архангельск', 'Екатеринбург', 'Самара', 'Владивосток', 'Казань', 'Санкт-Петербург', 'Москва']
print(cities[:-1])  # ['Москва', 'Санкт-Петербург', 'Казань', 'Владивосток', 'Самара', 'Екатеринбург']
print(cities[-1])  # Архангельск
# **********************************************************************************************************************
